{
  "home": "Главная",
  "skills": "Навыки",
  "projects": "Проекты",
  "contacts": "Контакты",
  "downloadCV": "Скачать CV",
  "frontendDeveloper": "Фронтенд Разработчик",
  "pavel": "Павел",
  "voitov": "Войтов",
  "link": "Ссылка",
  "hire": "Связаться",
  "name": "Имя",
  "yourMassage": "Ваше сообщение",
  "send": "Отправить",
  "creator": "Разработал Павел Войтов",
  "conditions": "Я рассматриваю варианты удаленной работы и переезда в любую точку мира.",
  "JAVASCRIPT": {
    "description": "Типы данных. Циклы, условия, работа с объектами. Функции. Прототипы и наследование. Работа с объектами. Методы массива. Промисы."
  },
  "TYPESCRIPT": {
    "description": "Знание структур данных, алгоритмов и способов их использования. Типизация данных в приложениях. Интерфейсы. Типы утилит. Дженерики."
  },
  "REACT": {
    "description": "Использование классовых/функциональных компонентов. Знание хуков, HOC, жизненных методов и жизненного цикла компонентов. Понимание преимуществ работы с React."
  },
  "HTML": {
    "description": "Создание структуры html-страниц. Работа с текстом, изображениями, ссылками. Использование семантических тегов. Кроссбраузерная адаптивная верстка."
  },
  "CSS/SASS": {
    "description": "Использование модулей SCSS и SASS для стилизации веб-страниц. Понимание основ, принципов и правил работы. Flex и Grid технологии.',"
  },
  "GIT": {
    "description": "Работа с онлайн-сервисом для хостинга проектов. Совместная разработка приложений. Работа с ветками, слияние изменений, развертывание."
  },
  "MATERIAL UI": {
    "description": "Использование библиотеки Material-UI для создания адаптивных и визуально привлекательных пользовательских интерфейсов."
  },
  "REDUX/REDUX TOOLKIT": {
    "description": "Внедрение Redux для управления состоянием в приложениях. Применение actions, reducers и thunks для эффективного управления состоянием приложения."
  },
  "POSTMAN": {
    "description": "Использование Postman для разработки и тестирования API. Работа с различными протоколами API и дополнительными функциями."
  },
  "TAILWIND": {
    "description": "Применение Tailwind для эффективной стилизации веб-приложений. Знакомство с классовым подходом Tailwind и принципами адаптивного дизайна"
  },
  "VUE/VUEX": {
    "description": "Создание приложений с помощью Vue.js и управление состоянием с помощью Vuex. Понимание компонентов Vue, директив и реактивности. Реализация сложных решений по управлению состоянием."
  },
  "BOOTSTRAP": {
    "description": "Применение платформы Bootstrap для быстрой и гибкой разработки интерфейса. Понимание компонентов Bootstrap, сеток и служебных классов"
  }
}