{
  "home": "Home",
  "skills": "Skills",
  "projects": "Projects",
  "contacts": "Contacts",
  "downloadCV": "Download CV",
  "frontendDeveloper": "Frontend Developer",
  "pavel": "Pavel",
  "voitov": "Voitov",
  "hire": "Hire",
  "name": "Name",
  "yourMassage": "Your massage",
  "send": "Send",
  "creator": "Created by Pavel Voitov",
  "conditions": "I am considering options for remote work and relocation anywhere in the world",
  "link": "Link",
  "JAVASCRIPT": {
    "description": "Data types. Cycles, conditions, work with objects. Functions. Prototypes and inheritance. Working with objects. Array methods. Promises."
  },
  "TYPESCRIPT": {
    "description": "Knowledge of data structures and algorithms and how they are used. Data typing in applications. Interfaces. Utility Types. Generics."
  },
  "REACT": {
    "description": "Using class/functional components. Knowledge of hooks, HOCs, life methods and component life cycle. Understanding the benefits of working with React."
  },
  "HTML": {
    "description": "Creation of the structure of the html pages. Working with text, images, links. Using semantic tags."
  },
  "CSS/SASS": {
    "description": "Using SCSS and SASS modules to style web pages. Understanding the basics, principles and rules of work. Flex and Grid technologies. Сross-browser adaptive layout."
  },
  "GIT": {
    "description": "Working with online project hosting service. Joint development of applications. Working with branches, merge, deploy."
  },
  "MATERIAL UI": {
    "description": "Utilizing Material-UI library for building responsive and visually appealing user interfaces."
  },
  "REDUX/REDUX TOOLKIT": {
    "description": "Implementing Redux for state management in applications. Applying actions, reducers, and thunks for effective application state management."
  },
  "POSTMAN": {
    "description": "Using Postman to develop and test APIs. Working with various API protocols and additional features."
  },
  "TAILWIND": {
    "description": "Utilizing Tailwind CSS for efficient and utility-first styling of web applications. Familiarity with Tailwind's class-based approach and responsive design principles."
  },
  "VUE/VUEX": {
    "description": "Building applications with Vue.js and managing state with Vuex. Understanding Vue components, directives, and reactivity. Implementing complex state management solutions."
  },
  "BOOTSTRAP": {
    "description": "Applying Bootstrap framework for rapid and responsive front-end development. Understanding Bootstrap components, grids, and utility classes"
  },
  "NUXT": {
    "description": "Working with lifecycle methods. Server-side rendering support. Handling routing and state management with Vuex. Creating universal applications with client-side and server-side rendering."
  },
  "NEXT": {
    "description": "Image optimization. Server-side rendering and static site generation support. Integration with React. Simple and efficient routing and state management."
  },
  "REACT NATIVE": {
    "description": "Developing cross-platform mobile applications using React Native and Expo. Building scalable architecture, managing state with Redux, implementing navigation flows, offline synchronization, API integration, and optimizing performance for iOS and Android platforms."
  },
  "projectsDescription": {
    "social-network": "A social network in 8-bit style where users can exchange messages, share content, and make new friends.",
    "peat-calculator": "Web application for calculating the proportions of peat in production and accounting for peat stored in warehouses.",
    "education-cards": "SPA for optimizing the learning process. It provides the ability to track progress, sort, and review material.",
    "task-recorder": "An application for daily task management, providing the ability to create, plan, and edit tasks.",
    "citrinium": "Website for a dental clinic with a contact form and responsive design ensures convenient access to information and appointment booking on all devices.",
    "stxlotty": "STXLOTTY is a Web3 next-generation lottery platform that connects into the Stacks platform. It uses blockchain technology to allow decentralized operations with great gains, transparency, privacy and security.",
    "agro-mng-web": "Internal web platform for agricultural field management: maps, layers, and operational workflows. NDA: no public link."
  }
}